
const hospitalsByRegion = {
  bangkok: [
    {
      id: 1,
      name: "โรงพยาบาล บี.แคร์ เมดิคอลเซ็นเตอร์",
      province: "กรุงเทพมหานคร",
    },
    {
      id: 2,
      name: "โรงพยาบาลกรุงเทพ",
      province: "กรุงเทพมหานคร",
    },
    {
      id: 3,
      name: "โรงพยาบาลกรุงเทพคริสเตียน",
      province: "กรุงเทพมหานคร",
    },
    {
      id: 4,
      name: "โรงพยาบาลกล้วยน้ำไท 1",
      province: "กรุงเทพมหานคร",
    },
    {
      id: 5,
      name: "โรงพยาบาลกล้วยน้ำไท 2",
      province: "กรุงเทพมหานคร",
    },
    {
      id: 6,
      name: "โรงพยาบาลคามิลเลียน",
      province: "กรุงเทพมหานคร",
    },
    {
      id: 7,
      name: "โรงพยาบาลธนบุรี 1",
      province: "กรุงเทพมหานคร",
    },
    {
      id: 8,
      name: "โรงพยาบาลธนบุรี 2",
      province: "กรุงเทพมหานคร",
    },
    {
      id: 9,
      name: "โรงพยาบาลนครธน",
      province: "กรุงเทพมหานคร",
    },
    {
      id: 10,
      name: "โรงพยาบาลนวมินทร์",
      province: "กรุงเทพมหานคร",
    },
    {
      id: 11,
      name: "โรงพยาบาลนวมินทร์ 9",
      province: "กรุงเทพมหานคร",
    },
    {
      id: 12,
      name: "โรงพยาบาลบางปะกอก 1",
      province: "กรุงเทพมหานคร",
    },
    {
      id: 13,
      name: "โรงพยาบาลบางปะกอก 8",
      province: "กรุงเทพมหานคร",
    },
    {
      id: 14,
      name: "โรงพยาบาลบางปะกอก 9 อินเตอร์เนชั่นแนล",
      province: "กรุงเทพมหานคร",
    },
    {
      id: 15,
      name: "โรงพยาบาลบางมด",
      province: "กรุงเทพมหานคร",
    },
    {
      id: 16,
      name: "โรงพยาบาลบางโพ",
      province: "กรุงเทพมหานคร",
    },
    {
      id: 17,
      name: "โรงพยาบาลบำรุงราษฎร์",
      province: "กรุงเทพมหานคร",
    },
    {
      id: 18,
      name: "โรงพยาบาลบี เอ็น เอช",
      province: "กรุงเทพมหานคร",
    },
    {
      id: 19,
      name: "โรงพยาบาลปิยะเวท",
      province: "กรุงเทพมหานคร",
    },
    {
      id: 20,
      name: "โรงพยาบาลพญาไท 1",
      province: "กรุงเทพมหานคร",
    },
    {
      id: 21,
      name: "โรงพยาบาลพญาไท 2",
      province: "กรุงเทพมหานคร",
    },
    {
      id: 22,
      name: "โรงพยาบาลพญาไท 3",
      province: "กรุงเทพมหานคร",
    },
    {
      id: 23,
      name: "โรงพยาบาลพญาไท นวมินทร์",
      province: "กรุงเทพมหานคร",
    },
    {
      id: 24,
      name: "โรงพยาบาลพระรามเก้า",
      province: "กรุงเทพมหานคร",
    },
    {
      id: 25,
      name: "โรงพยาบาลมงกุฎวัฒนะ",
      province: "กรุงเทพมหานคร",
    },
    {
      id: 26,
      name: "โรงพยาบาลมิชชั่น",
      province: "กรุงเทพมหานคร",
    },
    {
      id: 27,
      name: "โรงพยาบาลมเหสักข์",
      province: "กรุงเทพมหานคร",
    },
    {
      id: 28,
      name: "โรงพยาบาลยันฮี",
      province: "กรุงเทพมหานคร",
    },
    {
      id: 29,
      name: "โรงพยาบาลรามคำแหง",
      province: "กรุงเทพมหานคร",
    },
    {
      id: 30,
      name: "โรงพยาบาลราษฎร์บูรณะ",
      province: "กรุงเทพมหานคร",
    },
    {
      id: 31,
      name: "โรงพยาบาลลาดพร้าว",
      province: "กรุงเทพมหานคร",
    },
    {
      id: 32,
      name: "โรงพยาบาลวิชัยยุทธ",
      province: "กรุงเทพมหานคร",
    },
    {
      id: 33,
      name: "โรงพยาบาลวิชัยเวช อินเตอร์แนชั่นแนล หนองแขม",
      province: "กรุงเทพมหานคร",
    },
    {
      id: 34,
      name: "โรงพยาบาลวิภาราม พัฒนาการ",
      province: "กรุงเทพมหานคร",
    },
    {
      id: 35,
      name: "โรงพยาบาลวิภาวดี",
      province: "กรุงเทพมหานคร",
    },
    {
      id: 36,
      name: "โรงพยาบาลศรีวิชัย 1",
      province: "กรุงเทพมหานคร",
    },
    {
      id: 37,
      name: "โรงพยาบาลศิครินทร์",
      province: "กรุงเทพมหานคร",
    },
    {
      id: 38,
      name: "โรงพยาบาลศิริราช",
      province: "กรุงเทพมหานคร",
    },
    {
      id: 39,
      name: "โรงพยาบาลศิริราชปิยมหาราชการุณย์",
      province: "กรุงเทพมหานคร",
    },
    {
      id: 40,
      name: "โรงพยาบาลสมิติเวช ธนบุรี",
      province: "กรุงเทพมหานคร",
    },
    {
      id: 41,
      name: "โรงพยาบาลสมิติเวช ศรีนครินทร์",
      province: "กรุงเทพมหานคร",
    },
    {
      id: 42,
      name: "โรงพยาบาลสมิติเวช สุขุมวิท",
      province: "กรุงเทพมหานคร",
    },
    {
      id: 43,
      name: "โรงพยาบาลสมิติเวชไชน่าทาวน์",
      province: "กรุงเทพมหานคร",
    },
    {
      id: 44,
      name: "โรงพยาบาลสายไหม",
      province: "กรุงเทพมหานคร",
    },
    {
      id: 45,
      name: "โรงพยาบาลสินแพทย์",
      province: "กรุงเทพมหานคร",
    },
    {
      id: 46,
      name: "โรงพยาบาลสุขสวัสดิ์",
      province: "กรุงเทพมหานคร",
    },
    {
      id: 47,
      name: "โรงพยาบาลสุขุมวิท",
      province: "กรุงเทพมหานคร",
    },
    {
      id: 48,
      name: "โรงพยาบาลหัวเฉียว",
      province: "กรุงเทพมหานคร",
    },
    {
      id: 49,
      name: "โรงพยาบาลเกษมราษฎร์บางแค",
      province: "กรุงเทพมหานคร",
    },
    {
      id: 50,
      name: "โรงพยาบาลเกษมราษฏร์ประชาชื่น",
      province: "กรุงเทพมหานคร",
    },
    {
      id: 51,
      name: "โรงพยาบาลเจ้าพระยา",
      province: "กรุงเทพมหานคร",
    },
    {
      id: 52,
      name: "โรงพยาบาลเซนต์หลุยส์",
      province: "กรุงเทพมหานคร",
    },
    {
      id: 53,
      name: "โรงพยาบาลเซ็นทรัลเยนเนอรัล",
      province: "กรุงเทพมหานคร",
    },
    {
      id: 54,
      name: "โรงพยาบาลเทพธารินทร์",
      province: "กรุงเทพมหานคร",
    },
    {
      id: 55,
      name: "โรงพยาบาลเปาโล เกษตร",
      province: "กรุงเทพมหานคร",
    },
    {
      id: 56,
      name: "โรงพยาบาลเปาโลเมโมเรียล พหลโยธิน",
      province: "กรุงเทพมหานคร",
    },
    {
      id: 57,
      name: "โรงพยาบาลเปาโลเมโมเรียล โชคชัย4",
      province: "กรุงเทพมหานคร",
    },
    {
      id: 58,
      name: "โรงพยาบาลเพชรเวช",
      province: "กรุงเทพมหานคร",
    },
    {
      id: 59,
      name: "โรงพยาบาลเวชธานี",
      province: "กรุงเทพมหานคร",
    },
    {
      id: 60,
      name: "โรงพยาบาลเสรีรักษ์",
      province: "กรุงเทพมหานคร",
    },
    {
      id: 61,
      name: "โรงพยาบาลแพทย์ปัญญา",
      province: "กรุงเทพมหานคร",
    },
    {
      id: 62,
      name: "โรงพยาบาลไทยนครินทร์",
      province: "กรุงเทพมหานคร",
    },
    {
      id: 63,
      name: "โรงพยาบาลกรุงเทพคริสเตียน นครปฐม",
      province: "นครปฐม",
    },
    {
      id: 64,
      name: "โรงพยาบาลกรุงเทพสนามจันทร์",
      province: "นครปฐม",
    },
    {
      id: 65,
      name: "โรงพยาบาลเทพากร",
      province: "นครปฐม",
    },
    {
      id: 66,
      name: "สมิติเวชรัตนาธิเบศร์คลินิกเวชกรรม",
      province: "นนทบุรี",
    },
    {
      id: 67,
      name: "โรงพยาบาลกรุงไทย",
      province: "นนทบุรี",
    },
    {
      id: 68,
      name: "โรงพยาบาลนนทเวช",
      province: "นนทบุรี",
    },
    {
      id: 69,
      name: "โรงพยาบาลเกษมราษฎร์ อินเตอร์เนชั่นแนล รัตนาธิเบศร์",
      province: "นนทบุรี",
    },
    {
      id: 70,
      name: "โรงพยาบาลเวิลด์ เมดิคอล เซ็นเตอร์",
      province: "นนทบุรี",
    },
    {
      id: 71,
      name: "โรงพยาบาลกรุงสยามเซนต์คาร์ลอส",
      province: "ปทุมธานี",
    },
    {
      id: 72,
      name: "โรงพยาบาลการุญเวช ปทุมธานี",
      province: "ปทุมธานี",
    },
    {
      id: 73,
      name: "โรงพยาบาลบางปะกอกรังสิต 2",
      province: "ปทุมธานี",
    },
    {
      id: 74,
      name: "โรงพยาบาลภัทร-ธนบุรี",
      province: "ปทุมธานี",
    },
    {
      id: 75,
      name: "โรงพยาบาลเฉพาะทางแม่และเด็กแพทย์รังสิต",
      province: "ปทุมธานี",
    },
    {
      id: 76,
      name: "โรงพยาบาลเปาโล รังสิต",
      province: "ปทุมธานี",
    },
    {
      id: 77,
      name: "โรงพยาบาลแพทย์รังสิต",
      province: "ปทุมธานี",
    },
    {
      id: 78,
      name: "โรงพยาบาลราชธานี",
      province: "พระนครศรีอยุธยา",
    },
    {
      id: 79,
      name: "โรงพยาบาลราชธานี โรจนะ",
      province: "พระนครศรีอยุธยา",
    },
    {
      id: 80,
      name: "โรงพยาบาลศุภมิตรเสนา",
      province: "พระนครศรีอยุธยา",
    },
    {
      id: 81,
      name: "สมิติเวชสุวรรณภูมิคลินิกเวชกรรม",
      province: "สมุทรปราการ",
    },
    {
      id: 82,
      name: "โรงพยาบาลจุฬารัตน์ 3 (เทพารักษ์)",
      province: "สมุทรปราการ",
    },
    {
      id: 83,
      name: "โรงพยาบาลจุฬารัตน์ 9 (กิ่งแก้ว)",
      province: "สมุทรปราการ",
    },
    {
      id: 84,
      name: "โรงพยาบาลบางนา 5",
      province: "สมุทรปราการ",
    },
    {
      id: 85,
      name: "โรงพยาบาลบางปะกอก 3",
      province: "สมุทรปราการ",
    },
    {
      id: 86,
      name: "โรงพยาบาลบางปะกอกสมุทรปราการ",
      province: "สมุทรปราการ",
    },
    {
      id: 87,
      name: "โรงพยาบาลพริ้นซ์ ฮอสพิทอล",
      province: "สมุทรปราการ",
    },
    {
      id: 88,
      name: "โรงพยาบาลวิภาราม ชัยปราการ",
      province: "สมุทรปราการ",
    },
    {
      id: 89,
      name: "โรงพยาบาลสำโรง",
      province: "สมุทรปราการ",
    },
    {
      id: 90,
      name: "โรงพยาบาลสินแพทย์ เทพารักษ์",
      province: "สมุทรปราการ",
    },
    {
      id: 91,
      name: "โรงพยาบาลเปาโล พระประแดง",
      province: "สมุทรปราการ",
    },
    {
      id: 92,
      name: "โรงพยาบาลเปาโลเมโมเรียล สมุทรปราการ",
      province: "สมุทรปราการ",
    },
    {
      id: 93,
      name: "โรงพยาบาลเมืองสมุทร ปากน้ำ",
      province: "สมุทรปราการ",
    },
    {
      id: 94,
      name: "โรงพยาบาลมหาชัย 1",
      province: "สมุทรสาคร",
    },
    {
      id: 95,
      name: "โรงพยาบาลมหาชัย 2",
      province: "สมุทรสาคร",
    },
    {
      id: 96,
      name: "โรงพยาบาลมหาชัย 3",
      province: "สมุทรสาคร",
    },
    {
      id: 97,
      name: "โรงพยาบาลวิชัยเวช อินเตอร์เนชั่นแนล สมุทรสาคร",
      province: "สมุทรสาคร",
    },
    {
      id: 98,
      name: "โรงพยาบาลวิชัยเวช อินเตอร์เนชั่นแนล อ้อมน้อย",
      province: "สมุทรสาคร",
    },
    {
      id: 99,
      name: "โรงพยาบาลวิภาราม สมุทรสาคร",
      province: "สมุทรสาคร",
    },
    {
      id: 100,
      name: "โรงพยาบาลเอกชัย",
      province: "สมุทรสาคร",
    },
    {
      id: 101,
      name: "โรงพยาบาลมหาชัยแม่กลอง",
      province: "สมุทรสงคราม",
    },
  ],
  central: [
    {
      id: 102,
      name: "โรงพยาบาลกาญจนบุรีเมโมเรียล",
      province: "กาญจนบุรี",
    },
    {
      id: 103,
      name: "โรงพยาบาลธนกาญจน์",
      province: "กาญจนบุรี",
    },
    {
      id: 104,
      name: "โรงพยาบาลเอกชนเมืองกำแพง",
      province: "กำแพงเพชร",
    },
    {
      id: 105,
      name: "โรงพยาบาลนครแม่สอด อินเตอร์เนชั่นแนล",
      province: "ตาก",
    },
    {
      id: 106,
      name: "โรงพยาบาลแม่สอด-ราม",
      province: "ตาก",
    },
    {
      id: 107,
      name: "ศูนย์การแพทย์สมเด็จพระเทพรัตนราชสุดาฯสยามบรมราชกุมารี",
      province: "นครนายก",
    },
    {
      id: 108,
      name: "โรงพยาบาลปากน้ำโพ",
      province: "นครสวรรค์",
    },
    {
      id: 109,
      name: "โรงพยาบาลปากน้ำโพ 2",
      province: "นครสวรรค์",
    },
    {
      id: 110,
      name: "โรงพยาบาลร่มฉัตร",
      province: "นครสวรรค์",
    },
    {
      id: 111,
      name: "โรงพยาบาลศรีสวรรค์",
      province: "นครสวรรค์",
    },
    {
      id: 112,
      name: "โรงพยาบาลสหเวช",
      province: "พิจิตร",
    },
    {
      id: 113,
      name: "โรงพยาบาลกรุงเทพเพชรบุรี",
      province: "เพชรบุรี",
    },
    {
      id: 114,
      name: "โรงพยาบาลมหาชัยเพชรรัชต์",
      province: "เพชรบุรี",
    },
    {
      id: 115,
      name: "โรงพยาบาลเพชรรัตน์",
      province: "เพชรบูรณ์",
    },
    {
      id: 116,
      name: "โรงพยาบาลกรุงเทพพิษณุโลก",
      province: "พิษณุโลก",
    },
    {
      id: 117,
      name: "โรงพยาบาลพิษณุเวช",
      province: "พิษณุโลก",
    },
    {
      id: 118,
      name: "โรงพยาบาลพิษณุโลกฮอสพิทอล",
      province: "พิษณุโลก",
    },
    {
      id: 119,
      name: "โรงพยาบาลรวมแพทย์พิษณุโลก",
      province: "พิษณุโลก",
    },
    {
      id: 120,
      name: "โรงพยาบาลซานคามิลโล",
      province: "ราชบุรี",
    },
    {
      id: 121,
      name: "โรงพยาบาลเมืองราช",
      province: "ราชบุรี",
    },
    {
      id: 122,
      name: "โรงพยาบาลเบญจรมย์",
      province: "ลพบุรี",
    },
    {
      id: 123,
      name: "โรงพยาบาลเมืองนารายณ์",
      province: "ลพบุรี",
    },
    {
      id: 124,
      name: "โรงพยาบาลรวมแพทย์สุโขทัย",
      province: "สุโขทัย",
    },
    {
      id: 125,
      name: "โรงพยาบาลสิงห์บุรีเวชการ",
      province: "สิงห์บุรี",
    },
    {
      id: 126,
      name: "โรงพยาบาลธนบุรีอู่ทอง",
      province: "สุพรรณบุรี",
    },
    {
      id: 127,
      name: "โรงพยาบาลวิภาวดี ปิยราษฎร์",
      province: "สุพรรณบุรี",
    },
    {
      id: 128,
      name: "โรงพยาบาลศุภมิตร สุพรรณ",
      province: "สุพรรณบุรี",
    },
    {
      id: 129,
      name: "โรงพยาบาลเกษมราษฎร์สระบุรี",
      province: "สระบุรี",
    },
    {
      id: 130,
      name: "โรงพยาบาลอ่างทองเวชการ",
      province: "อ่างทอง",
    },
  ],
  northeast: [
    {
      id: 131,
      name: "โรงพยาบาลธีรวัฒน์",
      province: "กาฬสินธุ์",
    },
    {
      id: 132,
      name: "โรงพยาบาลกรุงเทพขอนแก่น",
      province: "ขอนแก่น",
    },
    {
      id: 133,
      name: "โรงพยาบาลขอนแก่นราม",
      province: "ขอนแก่น",
    },
    {
      id: 134,
      name: "โรงพยาบาลราชพฤกษ์",
      province: "ขอนแก่น",
    },
    {
      id: 135,
      name: "โรงพยาบาลศรีนครินทร์ ม.ขอนแก่น",
      province: "ขอนแก่น",
    },
    {
      id: 136,
      name: "โรงพยาบาล ป.แพทย์",
      province: "นครราชสีมา",
    },
    {
      id: 137,
      name: "โรงพยาบาลกรุงเทพปากช่อง",
      province: "นครราชสีมา",
    },
    {
      id: 138,
      name: "โรงพยาบาลกรุงเทพราชสีมา",
      province: "นครราชสีมา",
    },
    {
      id: 139,
      name: "โรงพยาบาลเซนต์เมรี่",
      province: "นครราชสีมา",
    },
    {
      id: 140,
      name: "โรงพยาบาลเอกชนบุรีรัมย์",
      province: "บุรีรัมย์",
    },
    {
      id: 141,
      name: "โรงพยาบาลมุกดาหารอินเตอร์เนชั่นแนล",
      province: "มุกดาหาร",
    },
    {
      id: 142,
      name: "โรงพยาบาลมหาสารคามอินเตอร์เนชั่นแนล",
      province: "มหาสารคาม",
    },
    {
      id: 143,
      name: "โรงพยาบาลนายแพทย์หาญ",
      province: "ยโสธร",
    },
    {
      id: 144,
      name: "โรงพยาบาลจุรีเวช",
      province: "ร้อยเอ็ด",
    },
    {
      id: 145,
      name: "โรงพยาบาลร้อยเอ็ดธนบุรี",
      province: "ร้อยเอ็ด",
    },
    {
      id: 146,
      name: "โรงพยาบาลเมืองเลยราม",
      province: "เลย",
    },
    {
      id: 147,
      name: "โรงพยาบาลประชารักษ์เวชการ",
      province: "ศรีสะเกษ",
    },
    {
      id: 148,
      name: "โรงพยาบาลรักษ์สกล",
      province: "สกลนคร",
    },
    {
      id: 149,
      name: "โรงพยาบาลหนองคายวัฒนา",
      province: "หนองคาย",
    },
    {
      id: 150,
      name: "โรงพยาบาลวีระพลการแพทย์",
      province: "หนองบัวลำภู",
    },
    {
      id: 151,
      name: "โรงพยาบาลกรุงเทพอุดร",
      province: "อุดรธานี",
    },
    {
      id: 152,
      name: "โรงพยาบาลนอร์ทอีสเทอร์น-วัฒนา",
      province: "อุดรธานี",
    },
    {
      id: 153,
      name: "โรงพยาบาลเอกอุดร",
      province: "อุดรธานี",
    },
    {
      id: 154,
      name: "โรงพยาบาลราชเวช อุบลราชธานี",
      province: "อุบลราชธานี",
    },
    {
      id: 155,
      name: "โรงพยาบาลสรรพสิทธิ์อินเตอร์",
      province: "อุบลราชธานี",
    },
    {
      id: 156,
      name: "โรงพยาบาลอุบลรักษ์ ธนบุรี",
      province: "อุบลราชธานี",
    },
  ],
  south: [
    {
      id: 157,
      name: "โรงพยาบาลกระบี่นครินทร์ อินเตอร์เนชั่นแนล",
      province: "กระบี่",
    },
    {
      id: 158,
      name: "โรงพยาบาลธนบุรีชุมพร",
      province: "ชุมพร",
    },
    {
      id: 159,
      name: "โรงพยาบาลวิรัชศิลป์",
      province: "ชุมพร",
    },
    {
      id: 160,
      name: "โรงพยาบาลตรังรวมแพทย์",
      province: "ตรัง",
    },
    {
      id: 161,
      name: "โรงพยาบาลราชดำเนิน",
      province: "ตรัง",
    },
    {
      id: 162,
      name: "โรงพยาบาลวัฒนแพทย์ตรัง",
      province: "ตรัง",
    },
    {
      id: 163,
      name: "โรงพยาบาลนครคริสเตียน",
      province: "นครศรีธรรมราช",
    },
    {
      id: 164,
      name: "โรงพยาบาลนครพัฒน์",
      province: "นครศรีธรรมราช",
    },
    {
      id: 165,
      name: "โรงพยาบาลนครินทร์",
      province: "นครศรีธรรมราช",
    },
    {
      id: 166,
      name: "โรงพยาบาลกรุงเทพหัวหิน",
      province: "ประจวบคีรีขันธ์",
    },
    {
      id: 167,
      name: "โรงพยาบาลซานเปาโลหัวหิน",
      province: "ประจวบคีรีขันธ์",
    },
    {
      id: 168,
      name: "โรงพยาบาลกรุงเทพภูเก็ต",
      province: "ภูเก็ต",
    },
    {
      id: 169,
      name: "โรงพยาบาลดีบุก",
      province: "ภูเก็ต",
    },
    {
      id: 170,
      name: "โรงพยาบาลมิชชั่นภูเก็ต",
      province: "ภูเก็ต",
    },
    {
      id: 171,
      name: "โรงพยาบาลสิริโรจน์",
      province: "ภูเก็ต",
    },
    {
      id: 172,
      name: "โรงพยาบาลสิโรรส",
      province: "ยะลา",
    },
    {
      id: 173,
      name: "โรงพยาบาลกรุงเทพหาดใหญ่",
      province: "สงขลา",
    },
    {
      id: 174,
      name: "โรงพยาบาลราษฎร์ยินดี",
      province: "สงขลา",
    },
    {
      id: 175,
      name: "โรงพยาบาลศิครินทร์หาดใหญ่",
      province: "สงขลา",
    },
    {
      id: 176,
      name: "โรงพยาบาลทักษิณ",
      province: "สุราษฎร์ธานี",
    },
    {
      id: 177,
      name: "โรงพยาบาลบ้านดอน อินเตอร์เนชั่นแนล",
      province: "สุราษฎร์ธานี",
    },
    {
      id: 178,
      name: "โรงพยาบาลศรีวิชัย สุราษฎร์ธานี",
      province: "สุราษฎร์ธานี",
    },
    {
      id: 179,
      name: "โรงพยาบาลสมุยอินเตอร์เนชั่นแนล",
      province: "สุราษฎร์ธานี",
    },
  ],
  east: [
    {
      id: 180,
      name: "โรงพยาบาลกรุงเทพจันทบุรี",
      province: "จันทบุรี",
    },
    {
      id: 181,
      name: "โรงพยาบาลพระปกเกล้า",
      province: "จันทบุรี",
    },
    {
      id: 182,
      name: "โรงพยาบาลสิริเวช",
      province: "จันทบุรี",
    },
    {
      id: 183,
      name: "โรงพยาบาลจุฬารัตน์ 11 (บางปะกง)",
      province: "ฉะเชิงเทรา",
    },
    {
      id: 184,
      name: "โรงพยาบาลเกษมราษฎร์ฉะเชิงเทรา",
      province: "ฉะเชิงเทรา",
    },
    {
      id: 185,
      name: "โรงพยาบาลกรุงเทพพัทยา",
      province: "ชลบุรี",
    },
    {
      id: 186,
      name: "โรงพยาบาลชลบุรี",
      province: "ชลบุรี",
    },
    {
      id: 187,
      name: "โรงพยาบาลปิยะเวชช์ บ่อวิน",
      province: "ชลบุรี",
    },
    {
      id: 188,
      name: "โรงพยาบาลพญาไท ศรีราชา",
      province: "ชลบุรี",
    },
    {
      id: 189,
      name: "โรงพยาบาลวิภาราม อมตะนคร",
      province: "ชลบุรี",
    },
    {
      id: 190,
      name: "โรงพยาบาลวิภาราม แหลมฉบัง",
      province: "ชลบุรี",
    },
    {
      id: 191,
      name: "โรงพยาบาลสมิติเวช ชลบุรี",
      province: "ชลบุรี",
    },
    {
      id: 192,
      name: "โรงพยาบาลสมิติเวช ศรีราชา",
      province: "ชลบุรี",
    },
    {
      id: 193,
      name: "โรงพยาบาลเอกชล",
      province: "ชลบุรี",
    },
    {
      id: 194,
      name: "โรงพยาบาลเอกชล 2",
      province: "ชลบุรี",
    },
    {
      id: 195,
      name: "โรงพยาบาลกรุงเทพตราด",
      province: "ตราด",
    },
    {
      id: 196,
      name: "โรงพยาบาลกรุงเทพระยอง",
      province: "ระยอง",
    },
    {
      id: 197,
      name: "โรงพยาบาลศรีระยอง",
      province: "ระยอง",
    },
  ],
  north: [
    {
      id: 198,
      name: "โรงพยาบาลเกษมราษฎร์ศรีบุรินทร์",
      province: "เชียงราย",
    },
    {
      id: 199,
      name: "โรงพยาบาลเชียงรายอินเตอร์",
      province: "เชียงราย",
    },
    {
      id: 200,
      name: "โรงพยาบาลโอเวอร์บรุ๊คเชียงราย",
      province: "เชียงราย",
    },
    {
      id: 201,
      name: "ศูนย์ศรีพัฒน์ คณะแพทยศาสตร์ มหาวิทยาลัยเชียงใหม่",
      province: "เชียงใหม่",
    },
    {
      id: 202,
      name: "โรงพยาบาลกรุงเทพเชียงใหม่",
      province: "เชียงใหม่",
    },
    {
      id: 203,
      name: "โรงพยาบาลราชเวชเชียงใหม่",
      province: "เชียงใหม่",
    },
    {
      id: 204,
      name: "โรงพยาบาลลานนา",
      province: "เชียงใหม่",
    },
    {
      id: 205,
      name: "โรงพยาบาลเชียงใหม่ ฮอสพิทอล",
      province: "เชียงใหม่",
    },
    {
      id: 206,
      name: "โรงพยาบาลเชียงใหม่ราม 1",
      province: "เชียงใหม่",
    },
    {
      id: 207,
      name: "โรงพยาบาลเชียงใหม่เมดิคอลเซ็นเตอร์",
      province: "เชียงใหม่",
    },
    {
      id: 208,
      name: "โรงพยาบาลเชียงใหม่ใกล้หมอ",
      province: "เชียงใหม่",
    },
    {
      id: 209,
      name: "โรงพยาบาลเทพปัญญา",
      province: "เชียงใหม่",
    },
    {
      id: 210,
      name: "โรงพยาบาลเทพปัญญา 2",
      province: "เชียงใหม่",
    },
    {
      id: 211,
      name: "โรงพยาบาลแมคคอร์มิค",
      province: "เชียงใหม่",
    },
    {
      id: 212,
      name: "โรงพยาบาลพะเยาราม",
      province: "พะเยา",
    },
    {
      id: 213,
      name: "โรงพยาบาลแพร่คริสเตียน",
      province: "แพร่",
    },
    {
      id: 214,
      name: "โรงพยาบาลแพร่ราม",
      province: "แพร่",
    },
    {
      id: 215,
      name: "โรงพยาบาลเขลางค์นคร-ราม",
      province: "ลำปาง",
    },
    {
      id: 216,
      name: "โรงพยาบาลหริภุญชัยเมโมเรียล",
      province: "ลำพูน",
    },
  ],
};
export default hospitalsByRegion;
